Tutorials-2.4.0/shockTube/gas-subsonic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

asymmSolver PBiCG;

solvers
{
    "Y.*"
    {
        solver                  $asymmSolver;
        tolerance               1e-8;
        relTol                  0.0;
        preconditioner          DILU;
        smoother                DILUGaussSeidel;
        
        nLimiterIter		3;
    }

    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "(U|k|omega)"
    {
        solver                  $asymmSolver;
        tolerance               1e-8;
        relTol                  0.0;
        preconditioner          DILU;
        smoother                DILUGaussSeidel;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }

    "(h|hFinal)"
    {
        solver              $asymmSolver;
        preconditioner  DILU;
        tolerance        1e-8;
        relTol           0;
        smoother                DILUGaussSeidel;
    };

    p
    {
        solver               $asymmSolver;
        preconditioner  DILU;
        tolerance        1e-8;
        relTol           0;
        smoother                DILUGaussSeidel;
    }

    pFinal
    {
	$p;
    }
    
    "(Vb|Rb).*"
    {
	solver    diagonal;
    }
}

PIMPLE
{
    momentumPredictor       true;
    turbOnFinalIterOnly     true;

    transonic               on;

    nOuterCorrectors        1;
    nCorrectors             2;

    nNonOrthogonalCorrectors 1;
    
    
    //Hybrid scheme tune coefficients
    nonOrthogonalityThreshold 45.0;
    skewnessThreshold 2.0;
    
    MaThreshold 0.02;
    Amplitude 1.0;
    Slope 100;
}


// ************************************************************************* //
